app/controllers/auth_controller.rb

  def login
    credentials = login_params
    user = User.find_by email: credentials[:email]
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "babe@babe.babe"]]

  def register
    if User.create(register_params.merge(password_confirmation: nil)).valid?
---
INSERT INTO "users" ("username", "full_name", "email", "password_digest", "created_at", "updated_at", "token") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"