app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (start_date =< '2015-06-08 02:18:44.106217' AND end_date >= '2015-06-08 02:18:44.106226')
---
  def index
    # all the posts
    @posts = Post.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 3]]
---
  def show
    # find one Post by id
    @post = Post.find(params[:id])

INSERT INTO "posts" ("title", "body", "start_date", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", ""], ["body", ""], ["start_date", "2015-07-06 00:00:00.000000"], ["user_id", 4], ["created_at", "2015-06-08 02:16:25.974448"], ["updated_at", "2015-06-08 02:16:25.974448"]]
---
  def create

    @post = current_user.posts.new(post_params)
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 13]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 13]]
---
  def destroy
    @post = Post.find(params[:id])
    if @post.user = current_user
      @post.destroy