app/controllers/replies_controller.rb

SELECT "replies".* FROM "replies"
---
  def index
    # all the replies
    @replies = Reply.all

SELECT  "replies".* FROM "replies" WHERE "replies"."id" = $1 LIMIT 1  [["id", 3]]
---
  def show
    # find one Replyby id
    @reply = Reply.find(params[:id])

INSERT INTO "replies" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "now??"], ["post_id", 62], ["user_id", 35], ["created_at", "2015-06-06 23:29:01.136229"], ["updated_at", "2015-06-06 23:29:01.136229"]]
---
  def create
    @reply = Reply.new(reply_params)
    if @reply.save

SELECT  "replies".* FROM "replies" WHERE "replies"."id" = $1 LIMIT 1  [["id", 0]]
DELETE FROM "replies" WHERE "replies"."id" = $1  [["id", 10]]
---
  def destroy
    @reply = Reply.find(params[:id])
    @reply.destroy